In [1]:
people = {
    "first": ["Bayardo", "Josue"],
    "last": ["Lopez", "Salazar"],
    "email": ["bjlslopez@gmail.com", "bjlopezs@hotmail.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

     first     last                 email
0  Bayardo    Lopez   bjlslopez@gmail.com
1    Josue  Salazar  bjlopezs@hotmail.com

In [5]:
df['first'] + ' ' + df['last']

0    Bayardo Lopez
1    Josue Salazar
dtype: object

In [6]:
df['full_name'] = df['first'] + ' ' + df['last']

In [7]:
df

     first     last                 email      full_name
0  Bayardo    Lopez   bjlslopez@gmail.com  Bayardo Lopez
1    Josue  Salazar  bjlopezs@hotmail.com  Josue Salazar

In [9]:
df.drop(columns=['first', 'last'], inplace=True)

In [10]:
df

                  email      full_name
0   bjlslopez@gmail.com  Bayardo Lopez
1  bjlopezs@hotmail.com  Josue Salazar

In [12]:
df['full_name'].str.split(' ', expand=True)

         0        1
0  Bayardo    Lopez
1    Josue  Salazar

In [13]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [14]:
df

                  email      full_name    first     last
0   bjlslopez@gmail.com  Bayardo Lopez  Bayardo    Lopez
1  bjlopezs@hotmail.com  Josue Salazar    Josue  Salazar

In [15]:
df.append({'first': 'Tony'}, ignore_index=True)

/tmp/ipykernel_8147/67547244.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first': 'Tony'}, ignore_index=True)

                  email      full_name    first     last
0   bjlslopez@gmail.com  Bayardo Lopez  Bayardo    Lopez
1  bjlopezs@hotmail.com  Josue Salazar    Josue  Salazar
2                   NaN            NaN     Tony      NaN

In [16]:
people = {
    "first": ["2", "9", "A"],
    "last": ["B", "S", "2"],
    "email": ["YoRHaNo.2TypeB@gmail.com", "YoRHaNo.9TypeS@gmail.com", "YoRHaTypeANo.2@gmail.com"]
}
df2 = pd.DataFrame(people)

In [17]:
df2

  first last                     email
0     2    B  YoRHaNo.2TypeB@gmail.com
1     9    S  YoRHaNo.9TypeS@gmail.com
2     A    2  YoRHaTypeANo.2@gmail.com

In [19]:
df.append(df2, ignore_index=True, sort=False)

/tmp/ipykernel_8147/2503217469.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort=False)

                      email      full_name    first     last
0       bjlslopez@gmail.com  Bayardo Lopez  Bayardo    Lopez
1      bjlopezs@hotmail.com  Josue Salazar    Josue  Salazar
2  YoRHaNo.2TypeB@gmail.com            NaN        2        B
3  YoRHaNo.9TypeS@gmail.com            NaN        9        S
4  YoRHaTypeANo.2@gmail.com            NaN        A        2

In [20]:
df = df.append(df2, ignore_index=True, sort=False)

/tmp/ipykernel_8147/3370980109.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort=False)

In [21]:
df

                      email      full_name    first     last
0       bjlslopez@gmail.com  Bayardo Lopez  Bayardo    Lopez
1      bjlopezs@hotmail.com  Josue Salazar    Josue  Salazar
2  YoRHaNo.2TypeB@gmail.com            NaN        2        B
3  YoRHaNo.9TypeS@gmail.com            NaN        9        S
4  YoRHaTypeANo.2@gmail.com            NaN        A        2

In [22]:
df.drop(index=4)

                      email      full_name    first     last
0       bjlslopez@gmail.com  Bayardo Lopez  Bayardo    Lopez
1      bjlopezs@hotmail.com  Josue Salazar    Josue  Salazar
2  YoRHaNo.2TypeB@gmail.com            NaN        2        B
3  YoRHaNo.9TypeS@gmail.com            NaN        9        S

In [24]:
filt = df['last'] == 'B'
df.drop(index=df[filt].index)

                      email      full_name    first     last
0       bjlslopez@gmail.com  Bayardo Lopez  Bayardo    Lopez
1      bjlopezs@hotmail.com  Josue Salazar    Josue  Salazar
3  YoRHaNo.9TypeS@gmail.com            NaN        9        S
4  YoRHaTypeANo.2@gmail.com            NaN        A        2